# 再帰
# 134
# def p(g):
#   return [*map(list,zip(*p(g)[::-1]))] if hash(g:=(*zip(*g),)[::-1])%9 else [
#     *[[*(a:=[3]*4),*(b:=[0]*4),0]]*4,
#     *[[*b,*a,0]]*4,
#     [0]*9
#   ]
# bestは85なので改善の余地あり なんなら再帰じゃないと思う
# 123
# p=lambda g:[*map(list,zip(*p(g)[::-1]))] if hash(g:=(*zip(*g),)[::-1])%9 else [
#     *[a:=[*[3]*4,*[0]*5]]*4,
#     *[(a*2)[5:14]]*4,
#     *[a[5:]+a[:5]]*4,
#     [0]*9
#   ]
# 119 そもそも埋め込み部分でほぼ85文字あるし、埋め込みにクリティカルな改善がある気がする
p=lambda g:[
  *[(a:=[*[3]*4,*[0]*5])[::(w:=(h:=hash((27,*sum(g,[]),60)))%3-1)]]*4,
  *[(a*2)[5:14][::w]]*4,
  [0]*9
][::(h&3)-1]